# InstanceBinding Constructor (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
InstanceBinding Constructor
InstanceBinding Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| InstanceBinding()()()() | Constructs an empty instance binding. |
| InstanceBinding(CategorySet) | Constructs an instance binding with the set of categories passed. |

# See Also
InstanceBinding Class
InstanceBinding Members
Autodesk.Revit.DB Namespace